//sadržaj jelovnika
var myObj = {
    "jelovnik": [
        ["Доручак",
            "Каjгана од 3 jаjа",
            "Омлет шунка",
            "Омлет печурке",
            "Омлет качкаваљ",
            "Омлет микс",
            "Јаjа на око",
            "Јаjа на око са сланином",
            "Јаjа на око са шунком",
            "Попара",
            "Прженице",
            "Качамак",
            "Качамак са сланином",
            "Поховане паприке",
            "Паприке са каjмаком",
            "Манастирски доручак"],
        ["Хлеб",
            "Лепиња",
            "Пројице",
            "Цигански хлеб"
        ],

        ["Сиреви",
            "Качкаваљ",
            "Сир",
            "Каjмак",
            "Урнебес",
            "Паприка у павлаци"

        ],

        ["Хладна предјела (100гр)",
            "Говеђа пршута",
            "Свињска печеница",
            "Кулен",
            "Чварци",
            "Аjвар",
            "Пихтије",
            "Предjело за две особе",
            "Предjeло за четири особе"

        ],

        ["Топла предјела (порција)",
            "Печурке а жару",
            "Поховани качкаваљ",
            "Помфрит"

        ],

        ["Јела по поруџбини (порција)",
            "Карађорђева шницла",
            "Натур шницла",
            "Паришка шницла",
            "Гулаш са кромпир пиреом"

        ],

        ["Чорбе",
            "Телећа чорба",
            "Рибља чорба",
            "Мађарска чорба"

        ],

        ["Специјалитети куће",
            "Пилетина \"Извор\" ",
            "Батак са фета сиром",
            "Свињски филе са пршутом",
            "Шаjкача на пруге",
            "Манастирска гозба за две и четри особе"

        ],

        ["Јела са роштиља",
            "Ћевапи 5 ком / 10 ком",
            "Пљескавица 200 гр/ 400 гр",
            "Пуњена пљескавица 200 гр / 400 гр",
            "Гурманска пљескавица 200 гр / 400 гр",
            "Домаће кобасице 200 гр / 400 гр",
            "Димљена вешалица 200 гр / 400 гр",
            "Димљени врат 300 гр / 400 гр",
            "Бела вешалица 200 гр / 400 гр",
            "Свињски ражњићи 200 гр / 400 гр",
            "Пилећи ражњићи 200 гр / 400 гр",
            "Пилећа џигерица 200 гр / 400 гр",
            "Пилећи батак 200 гр / 400 гр",
            "Пилеће бело 200 гр / 400 гр",
            "Пилеће бело пуњено 200 гр / 400 гр",
            "Мешано месо са роштиља 1 кг"

        ],

        ["Риба 1кг",
            "Пастрмка",
            "Пастрмка димљена",
            "Шаран",
            "Димљени шаран",
            "Сом филе",
            "Гилице порција"

        ],

        ["Салате",
            "Љута папричица у уљу",
            "Белолучана паприка",
            "Парадајз",
            "Краставац",
            "Купус",
            "Шопска",
            "Српска",
            "Грчка",
            "Туршија",
            "Кисели купус",
            "Барена паприка"

        ],

        ["Посластице",
            "Баклава",
            "Урмашице",
            "Манастирске палачинке",
            "Палачинке (џем, крем-плазма, мед, шећер, ораси)",
            "Сладолед кугла"

        ],

        ["Топли напици",
            "Домаћа кафа",
            "Домаћи чаj",
            "Чај Кућа чаjа са медом",
            "Еспресо",
            "Еспресо са млеком",
            "Еспресо са шлагом",
            "Капућино",
            "Нес кафа",
            "Топла чоколада",
            "Бела кафа",
            "Кувано вино",
            "Кувано вино \"Извор\"",
            "Грејана ракиjа"

        ],

        ["Воде",
            "Врњци вода газирана 0,25",
            "Врњци вода негазирана 0,25",
            "Роса вода негазирана 0,33",
            "Врњци вода газирана 1 литар",
            "Врњци вода негазирана 1 литар",
            "Кисела вода чаша 0,1",
            "Кисела вода чаша 0,2"
        ],

        ["Безалкохолна пића",
            "Кока кола",
            "Фанта",
            "Битер лемон",
            "Сприте",
            "Тоник",
            "Кокта",
            "Ледени чај",
            "Ремикс Књаз",
            "\"Ултра\" енергетско пиће",
            "Гуарана",
            "\"Red Bull\" енергетско пиће",
            "\"Next\" сокови",
            "Цедевита",
            "Квас 0,33",
            "Лимунада",
            "Цеђена поморанџа"
        ],

        ["Манастирски дукати",
            "Ликер кајсија",
            "Ликер малина",
            "Ликер вишња",
            "Ликер аронија"
        ],

        ["Аперитиви",
            "Шљивовица",
            "Дуњевача",
            "Кајсијевача",
            "Виљамовка",
            "Лоза",
            "Стомаклија",
            "Медовача",
            "Боровњача",
            "Вињак",
            "Водка",
            "Водка Финландиа",
            "Џин",
            "Бадел коњак",
            "Пелинковац",
            "Јегер",
            "Бејлис",
            "Текила",
            "Рум",
            "Баба Риба / вишња ликери"
        ],

        ["Виски",
            "Ballantines",
            "Johnie Walker",
            "Jack Daniels",
            "Chivas Regal"
        ],

        ["Пива",
            "Старопрамен 0,33",
            "Јелен 0,5",
            "Јелен 0,33",
            "Никшићко 0,5",
            "Никшићко 0,33",
            "Никшићко тамно 0,33",
            "Туборг 0,5",
            "Туборг 0,33",
            "Зајечарско 0,5",
            "Зајечарско тамно 0,5",
            "Амстел 0,33",
            "Хајникен 0,4",
            "Јелен Фреш лимун 0,33",
            "Јелен Фреш грејп 0,33",
            "Сомерсби јабука",
            "Сомерсби крушка"
        ],

        ["Црна вина",
            "Црногорски вранац 1л",
            "Ждрепчева крв 1л",
            "Домаће црно вино 1 л",
            "Црни међаш Вино Жупа 0,7 л",
            "Лагум Мерлот 0,7 л",
            "Лагум Cabarnet souvignon 0,7",
            "Повардарје Вранец 0,7",
            "Црногорски Вранац 0,7",
            "Монарх Вранац 0,187",
            "Вранац црногорски 0,187",
            "Међаш црни 0,187",
            "Чаша црног вина 0,1",
            "Чаша црног вина 0,2",
            "Монарх вранац 0,7",
            "Монарх куве 0,7",
            "Тron cabarnet souvignon 0.7",
            "Tiver cabarnet souvignon 0.7"
        ],

        ["Воћна вина",
            "Di luna sangria 1l",
            "Di luna sangria 0.187 l",
            "Воћно вино купина",
            "Воћно вино боровница",
            "Воћно вино вишња",
            "Розе Рубин 1 л",
            "Розе Рубин 0,7 л",
            "Розе Трон 0,7 л"
        ]


    ]


};


window.onload = function () {

    var itemsLeftCount = Math.ceil(myObj.jelovnik.length / 2);

    for (var k = 0; k < myObj.jelovnik.length; k++) {
        var button1 = document.createElement("BUTTON");
        button1.className = "menu";
        var t = document.createTextNode(myObj.jelovnik[k][0]);
        button1.appendChild(t);
        if (k < Math.ceil(myObj.jelovnik.length / 2)) {
            document.getElementById("menu-left").appendChild(button1);
        } else {
            document.getElementById("menu-right").appendChild(button1);
        }

        var info1 = document.createElement("DIV");
        info1.className = "info";


        for (var j = 0; j < myObj.jelovnik[k].length - 1; j++) {
            var item1 = document.createElement("P");
            item1.innerHTML = myObj.jelovnik[k][j + 1];
            info1.appendChild(item1);
        }
        if (k < Math.ceil(myObj.jelovnik.length / 2)) {
            document.getElementById("menu-left").appendChild(info1);
        } else {
            document.getElementById("menu-right").appendChild(info1);
        }
    }



    // ovo je kod za jelovnik
    var acc = document.getElementsByClassName("menu");
    var i;

    for (i = 0; i < acc.length; i++) {
        acc[i].addEventListener("click", function () {
            this.classList.toggle("active");
            var panel = this.nextElementSibling;
            if (panel.style.display === "block") {
                panel.style.display = "none";
            } else {
                panel.style.display = "block";
            }
        });
    }
    //kraj koda za jelovnik


    //ovo je kod za slide galeriju
    var imgs = document.querySelectorAll(".block-20 img");
    imgs.forEach(function (img) {
        img.addEventListener("click", function (e) {
            document.getElementById("slide-block").innerHTML = "<img src='" + e.target.src + "' class='responsive-img'>";
        })
    });
}

//kraj koda za slide galeriju